import React from 'react';
import styles from './Footer.module.scss';
import {Logo} from "../Header/Logo";

const Footer = () => {
    const footerMenu = [
        {title: 'Каталог', link: ''},
        {title: 'Акции', link: '',},
        {title: 'Избранное', link: ''},
        {title: 'Поддержка', link: ''},
        {title: 'Контакты', link: ''},
        {title: 'Документы', link: ''}
    ]


    const socials = [
        {
            title: 'telegram',
            icon: `<svg width="24.000000" height="24.000000" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"><path id="Subtract" d="M12 24C18.6274 24 24 18.6274 24 12C24 5.37256 18.6274 0 12 0C5.37259 0 0 5.37256 0 12C0 18.6274 5.37259 24 12 24ZM12.43 8.85889Q10.6793 9.58716 5.43188 11.8733C4.86383 12.0991 4.56625 12.3203 4.53915 12.5364C4.49338 12.9016 4.95071 13.0454 5.57346 13.2412C5.65817 13.2678 5.74594 13.2954 5.83594 13.3247C6.44864 13.5237 7.27283 13.7568 7.70129 13.7661C8.08994 13.7744 8.52374 13.6143 9.00262 13.2854Q13.9054 9.97583 14.0643 9.9397C14.139 9.92285 14.2426 9.90137 14.3128 9.96387C14.3829 10.0261 14.376 10.1443 14.3686 10.176C14.3092 10.4294 11.2388 13.2222 11.0621 13.4055C10.968 13.5034 10.8721 13.5957 10.78 13.6846C10.2108 14.2334 9.78391 14.6448 10.8036 15.3169C11.8288 15.9924 12.4254 16.4233 13.4816 17.1157C13.6221 17.2078 13.7562 17.3035 13.8869 17.3965C14.3841 17.751 14.8307 18.0693 15.3826 18.0186C15.7032 17.989 16.0345 17.6875 16.2027 16.7883C16.6002 14.6631 17.3816 10.0583 17.5622 8.16089C17.578 7.99463 17.5581 7.78198 17.5421 7.68848C17.5262 7.59521 17.4928 7.46216 17.3714 7.36353C17.2276 7.24683 17.0056 7.22241 16.9064 7.22412C16.455 7.23193 15.7625 7.4729 12.43 8.85889Z" clip-rule="evenodd" fill="#98A2B3" fill-opacity="1.000000" fill-rule="evenodd"/></svg>`
        },
        {
            title: 'instagram',
            icon: `<svg width="24.000000" height="24.000000" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"><clipPath id="clip5_81448"><rect id="Platform=Instagram, Style=Gray, State=Default" width="24.000000" height="24.000000" fill="white" fill-opacity="0"/></clipPath></defs><rect id="Platform=Instagram, Style=Gray, State=Default" width="24.000000" height="24.000000" fill="#FFFFFF" fill-opacity="0"/><g clip-path="url(#clip5_81448)"><path id="Vector" d="M12 2.16C15.2 2.16 15.58 2.17 16.84 2.23C18.01 2.28 18.65 2.47 19.07 2.64C19.63 2.85 20.03 3.12 20.45 3.53C20.87 3.96 21.13 4.35 21.34 4.91C21.51 5.33 21.7 5.97 21.75 7.14C21.81 8.4 21.82 8.78 21.82 11.99C21.82 15.19 21.81 15.57 21.75 16.83C21.7 18 21.51 18.64 21.34 19.06C21.13 19.62 20.86 20.02 20.45 20.44C20.02 20.86 19.63 21.12 19.07 21.33C18.65 21.5 18.01 21.69 16.84 21.75C15.58 21.8 15.2 21.82 12 21.82C8.79 21.82 8.41 21.8 7.15 21.75C5.98 21.69 5.34 21.5 4.92 21.33C4.36 21.12 3.96 20.85 3.54 20.44C3.12 20.02 2.86 19.62 2.65 19.06C2.48 18.64 2.29 18 2.24 16.83C2.18 15.57 2.17 15.19 2.17 11.99C2.17 8.78 2.18 8.4 2.24 7.14C2.29 5.97 2.48 5.33 2.65 4.91C2.86 4.35 3.13 3.95 3.54 3.53C3.97 3.11 4.36 2.85 4.92 2.64C5.34 2.47 5.98 2.28 7.15 2.23C8.41 2.17 8.79 2.16 12 2.16ZM12 0C8.74 0 8.33 0.01 7.05 0.07C5.77 0.12 4.9 0.33 4.14 0.62C3.35 0.93 2.68 1.34 2.01 2.01C1.34 2.68 0.93 3.35 0.62 4.13C0.33 4.9 0.12 5.77 0.07 7.05C0.01 8.33 0 8.74 0 12C0 15.25 0.01 15.66 0.07 16.94C0.12 18.22 0.33 19.09 0.62 19.85C0.93 20.64 1.34 21.31 2.01 21.98C2.68 22.64 3.35 23.06 4.13 23.36C4.9 23.66 5.77 23.86 7.04 23.92C8.32 23.98 8.73 23.99 11.99 23.99C15.25 23.99 15.66 23.98 16.94 23.92C18.21 23.86 19.09 23.66 19.85 23.36C20.63 23.06 21.3 22.64 21.97 21.98C22.64 21.31 23.05 20.64 23.35 19.86C23.65 19.09 23.85 18.22 23.91 16.95C23.97 15.67 23.98 15.26 23.98 12C23.98 8.74 23.97 8.33 23.91 7.05C23.85 5.78 23.65 4.9 23.35 4.14C23.06 3.35 22.65 2.68 21.98 2.01C21.31 1.35 20.64 0.93 19.86 0.63C19.09 0.33 18.22 0.13 16.95 0.07C15.66 0.01 15.25 0 12 0Z" fill="#98A1B2" fill-opacity="1.000000" fill-rule="nonzero"/><path id="Vector" d="M12 5.83C8.59 5.83 5.83 8.59 5.83 12C5.83 15.4 8.59 18.16 12 18.16C15.4 18.16 18.16 15.4 18.16 12C18.16 8.59 15.4 5.83 12 5.83ZM12 15.99C9.79 15.99 8 14.2 8 12C8 9.79 9.79 8 12 8C14.2 8 15.99 9.79 15.99 12C15.99 14.2 14.2 15.99 12 15.99Z" fill="#98A2B3" fill-opacity="1.000000" fill-rule="nonzero"/><path id="Vector" d="M19.84 5.59C19.84 6.38 19.2 7.03 18.4 7.03C17.61 7.03 16.96 6.38 16.96 5.59C16.96 4.79 17.61 4.15 18.4 4.15C19.2 4.15 19.84 4.8 19.84 5.59Z" fill="#98A2B3" fill-opacity="1.000000" fill-rule="nonzero"/></g></svg>`
        },
        {
            title: 'twitter',
            icon: `<svg width="24.000000" height="19.000000" viewBox="0 0 24 19" fill="none" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"><defs/><path id="Vector" d="M7.55 18.75C16.6 18.75 21.55 11.24 21.55 4.74C21.55 4.53 21.55 4.31 21.54 4.1C22.5 3.4 23.33 2.54 24 1.55C23.1 1.95 22.14 2.21 21.17 2.32C22.2 1.71 22.97 0.74 23.33 -0.4C22.37 0.17 21.31 0.58 20.21 0.8C19.47 0.01 18.48 -0.52 17.41 -0.69C16.35 -0.87 15.25 -0.68 14.29 -0.17C13.34 0.34 12.58 1.15 12.13 2.14C11.68 3.12 11.57 4.23 11.81 5.29C9.86 5.19 7.94 4.68 6.19 3.79C4.45 2.91 2.9 1.66 1.67 0.14C1.04 1.23 0.85 2.51 1.13 3.73C1.41 4.95 2.15 6.02 3.19 6.71C2.41 6.69 1.64 6.48 0.96 6.1L0.96 6.16C0.96 7.3 1.35 8.4 2.07 9.28C2.79 10.16 3.8 10.77 4.91 10.99C4.19 11.19 3.43 11.22 2.69 11.07C3 12.05 3.62 12.91 4.44 13.52C5.26 14.13 6.26 14.48 7.29 14.5C5.54 15.87 3.39 16.61 1.17 16.61C0.78 16.61 0.39 16.58 0 16.53C2.25 17.98 4.87 18.75 7.55 18.75Z" fill="#98A1B2" fill-opacity="1.000000" fill-rule="nonzero"/></svg>`
        }
    ]

    return (
        <footer className={styles.footer}>
            <div className={styles['footer__wrapper']}>
                <div className={styles['footer__block']}>
                    <div className={styles['footer__block-top']}>
                        <div className={styles.footerBlock}>
                            <div className={styles['footer__card-logo']}>
                                <Logo />
                            </div>
                            <div className={styles['footer__card-text__wrapper']}>
                                <p className={`${styles['footer__card-text']} ma-0`}>Верните доступ к любимым зарубежным
                                    сервисам. Быстро. Просто. Безопасно</p>
                            </div>
                        </div>
                        <ul className={`${styles['footer__menu']} pa-0`}>
                            {footerMenu.map((link, index) => (
                                <li className={styles['footer__menu-item']} key={index}>
                                    <a href="#" className={styles['footer__menu-link']}>{link.title}</a>
                                </li>
                            ))}
                        </ul>
                    </div>
                    <div className={styles['footer__block-bottom']}>
                        <div className={`${styles['footer__socials']} d-flex ga-6 mb-6`}>
                            {socials.map((social, index) => (
                                <a href="#" className={styles['footer__socials-item']} key={index}>
                                    <div dangerouslySetInnerHTML={{__html: social.icon}}/>
                                </a>
                            ))}
                        </div>
                        <div className={styles['footer__copyright-text']}>
                            © 2024 Shopy
                        </div>
                    </div>
                </div>
            </div>
        </footer>
    );
};

export default Footer;
